src/Enums/СтатусыПроверкиМарокВДокументахМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыПроверкиМарокВДокументахМП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыполнялось</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПроверкиМарокВДокументахМП/Ext/ManagerModule.bsl
Функция ПолучитьИмя(СтатусВСД) Экспорт
	
	ИндексЗначения = Перечисления.СтатусыПроверкиМарокВДокументахМП.Индекс(СтатусВСД);
	
	Результат = Метаданные.Перечисления.СтатусыПроверкиМарокВДокументахМП.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСиноним(СтатусВСД) Экспорт
	
	ИндексЗначения = Перечисления.СтатусыПроверкиМарокВДокументахМП.Индекс(СтатусВСД);
	
	Результат = Метаданные.Перечисления.СтатусыПроверкиМарокВДокументахМП.ЗначенияПеречисления[ИндексЗначения].Синоним;
	
	РезультатСоответствие = Новый Соответствие;
	РезультатСоответствие.Вставить("Не выполнялось","Не выполнялась");
	РезультатСоответствие.Вставить("Выполняется","Выполняется");
	РезультатСоответствие.Вставить("Завершено","Завершено");
	
	Возврат РезультатСоответствие.Получить(Результат);
	
КонецФункции

Функция ПолучитьЗначение(СтатусВСД) Экспорт
	
	Результат = Неопределено;
	
	ЗначениеПеречисления = Метаданные.Перечисления.СтатусыПроверкиМарокВДокументахМП.ЗначенияПеречисления.Найти(СтатусВСД);
	Если Не ЗначениеПеречисления = Неопределено Тогда
		ИндексЗначения = Метаданные.Перечисления.СтатусыПроверкиМарокВДокументахМП.ЗначенияПеречисления.Индекс(ЗначениеПеречисления);
		Результат = Перечисления.СтатусыПроверкиМарокВДокументахМП[ИндексЗначения];
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
